app/controllers/notes_controller.rb

  def index
    @notes = Note.search(params[:search])
---
SELECT "notes".* FROM "notes" WHERE (lower(title) LIKE '%test%' OR description LIKE '%test%')

  def create
    @note = Note.new(note_params)

	respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("created_at", "description", "photo", "priority", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 10 Mar 2014 11:56:15 UTC +00:00], ["description", "gfdg"], ["photo", "fsd.jpg"], ["priority", "a"], ["title", "dsafgfdg"], ["updated_at", Mon, 10 Mar 2014 11:56:15 UTC +00:00]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "priority" = ?, "title" = ?, "description" = ?, "photo" = ?, "updated_at" = ? WHERE "notes"."id" = 15  [["priority", "c"], ["title", "rewter"], ["description", "tyrytuiuyi"], ["photo", "fsd.jpg"], ["updated_at", Wed, 12 Mar 2014 09:55:56 UTC +00:00]]

   def checked
    note = Note.find(params[:id])
    note.checked = 'true'
    note.save
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "notes" SET "checked" = ?, "updated_at" = ? WHERE "notes"."id" = 13  [["checked", true], ["updated_at", Sun, 30 Mar 2014 08:31:27 UTC +00:00]]

   def unchecked
    note = Note.find(params[:id])
    note.checked = 'false'
    note.save
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "notes" SET "checked" = ?, "updated_at" = ? WHERE "notes"."id" = 13  [["checked", "false"], ["updated_at", Sun, 30 Mar 2014 08:38:32 UTC +00:00]]

   def delchecked

     ary = Array.new();
   	Note.all.each do |note|
		if note.checked == 'true'
		 	ary.push(note.id)
		end
	end
	ary.each { |x|
		@note = Note.find(x)
		@note.destroy
---
SELECT "notes".* FROM "notes"
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 13]]

  def destroy
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 3]]

    def set_note
      @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "14"]]